In [1]:
import pandas as pd 
df = pd.read_csv('resale_flat_prices_2017_onwards.csv')
df.head(5)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2017-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0
1,2017-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0
2,2017-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0
3,2017-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0
4,2017-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0

In [32]:
df.storey_range.

'49'

In [30]:
df.lease_commence_date.max()

2019

In [28]:
df.floor_area_sqm.max()

249.0

In [2]:
#check for missing values 
df.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
remaining_lease        0
resale_price           0
dtype: int64

In [3]:
#check for object types 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 108616 entries, 0 to 108615
Data columns (total 11 columns):
month                  108616 non-null object
town                   108616 non-null object
flat_type              108616 non-null object
block                  108616 non-null object
street_name            108616 non-null object
storey_range           108616 non-null object
floor_area_sqm         108616 non-null float64
flat_model             108616 non-null object
lease_commence_date    108616 non-null int64
remaining_lease        108616 non-null object
resale_price           108616 non-null float64
dtypes: float64(2), int64(1), object(8)
memory usage: 9.1+ MB

In [4]:
#26 different towns in the dataset
# len(df['town'].unique())
df['town'].unique()

array(['ANG MO KIO', 'BEDOK', 'BISHAN', 'BUKIT BATOK', 'BUKIT MERAH',
       'BUKIT PANJANG', 'BUKIT TIMAH', 'CENTRAL AREA', 'CHOA CHU KANG',
       'CLEMENTI', 'GEYLANG', 'HOUGANG', 'JURONG EAST', 'JURONG WEST',
       'KALLANG/WHAMPOA', 'MARINE PARADE', 'PASIR RIS', 'PUNGGOL',
       'QUEENSTOWN', 'SEMBAWANG', 'SENGKANG', 'SERANGOON', 'TAMPINES',
       'TOA PAYOH', 'WOODLANDS', 'YISHUN'], dtype=object)

In [5]:
#7 different flat types
#len(df['flat_type'].unique())
df['flat_type'].unique()

array(['2 ROOM', '3 ROOM', '4 ROOM', '5 ROOM', 'EXECUTIVE', '1 ROOM',
       'MULTI-GENERATION'], dtype=object)

In [6]:
#20 different flat models --> each of them correspond to a certain floor area size after searching on it 

# len(df['flat_model'].unique())
df['flat_model'].unique()

array(['Improved', 'New Generation', 'DBSS', 'Standard', 'Apartment',
       'Simplified', 'Model A', 'Premium Apartment', 'Adjoined flat',
       'Model A-Maisonette', 'Maisonette', 'Type S1', 'Type S2',
       'Model A2', 'Terrace', 'Improved-Maisonette', 'Premium Maisonette',
       'Multi Generation', 'Premium Apartment Loft', '2-room'],
      dtype=object)

In [7]:
#preprocessing of data 

townDict = {'ANG MO KIO': 1,'BEDOK': 2,'BISHAN': 3,'BUKIT BATOK': 4,'BUKIT MERAH': 5,'BUKIT PANJANG': 6,'BUKIT TIMAH': 7,
            'CENTRAL AREA': 8,'CHOA CHU KANG': 9,'CLEMENTI': 10,'GEYLANG': 11,'HOUGANG': 12,'JURONG EAST': 13,'JURONG WEST': 14,
            'KALLANG/WHAMPOA': 15,'MARINE PARADE': 16,'PASIR RIS': 17,'PUNGGOL': 18,'QUEENSTOWN': 19,'SEMBAWANG': 20,
            'SENGKANG': 21,'SERANGOON': 22,'TAMPINES': 23,'TOA PAYOH': 24,'WOODLANDS': 25,'YISHUN': 26,}

flat_typeDict = {'1 ROOM': 1,'2 ROOM': 2,'3 ROOM': 3,'4 ROOM': 4,'5 ROOM': 5,'EXECUTIVE': 6,'MULTI-GENERATION': 7,}


#reason for converting datatype is because replace function was throwing out 
#   TypeError: Cannot compare types 'ndarray(dtype=int64)' and 'str'  

df['town']=df.town.astype(object)
df['town'] = df['town'].replace(townDict, regex=True) 

df['flat_type']=df.flat_type.astype(object)
df['flat_type'] = df['flat_type'].replace(flat_typeDict, regex=True)

In [8]:
df.head(5)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2017-01,1,2,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0
1,2017-01,1,3,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0
2,2017-01,1,3,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0
3,2017-01,1,3,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0
4,2017-01,1,3,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0

In [9]:
#split month column into year and month 
df['date'] = pd.to_datetime(df['month'])
df['month'] = df['date'].apply(lambda date:date.month)
df['year'] = df['date'].apply(lambda date:date.year)
df.head(5)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,date,year
0,1,1,2,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0,2017-01-01,2017
1,1,1,3,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0,2017-01-01,2017
2,1,1,3,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0,2017-01-01,2017
3,1,1,3,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0,2017-01-01,2017
4,1,1,3,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0,2017-01-01,2017

In [10]:
#handle storey range 
df['storey_range'] = df['storey_range'].apply(lambda storey_range:storey_range[:2])
df.head(5)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,date,year
0,1,1,2,406,ANG MO KIO AVE 10,10,44.0,Improved,1979,61 years 04 months,232000.0,2017-01-01,2017
1,1,1,3,108,ANG MO KIO AVE 4,01,67.0,New Generation,1978,60 years 07 months,250000.0,2017-01-01,2017
2,1,1,3,602,ANG MO KIO AVE 5,01,67.0,New Generation,1980,62 years 05 months,262000.0,2017-01-01,2017
3,1,1,3,465,ANG MO KIO AVE 10,04,68.0,New Generation,1980,62 years 01 month,265000.0,2017-01-01,2017
4,1,1,3,601,ANG MO KIO AVE 5,01,67.0,New Generation,1980,62 years 05 months,265000.0,2017-01-01,2017

In [11]:
#handle remaining lease
df['remaining_lease'] = df['remaining_lease'].apply(lambda remaining_lease:remaining_lease[:2])
df.head(5)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,date,year
0,1,1,2,406,ANG MO KIO AVE 10,10,44.0,Improved,1979,61,232000.0,2017-01-01,2017
1,1,1,3,108,ANG MO KIO AVE 4,01,67.0,New Generation,1978,60,250000.0,2017-01-01,2017
2,1,1,3,602,ANG MO KIO AVE 5,01,67.0,New Generation,1980,62,262000.0,2017-01-01,2017
3,1,1,3,465,ANG MO KIO AVE 10,04,68.0,New Generation,1980,62,265000.0,2017-01-01,2017
4,1,1,3,601,ANG MO KIO AVE 5,01,67.0,New Generation,1980,62,265000.0,2017-01-01,2017

In [12]:
#next, plot out corr matrix 

import seaborn as sns
import matplotlib.pyplot as plt
corrmat = df.corr()
plt.figure(figsize=(12, 4))
sns.set(font_scale=0.8)
sns.heatmap(corrmat,square=True, annot=True)
plt.show()

In [13]:
#from the above heatmap, we can drop some columns
data = df[['town', 'flat_type', 'floor_area_sqm', 'lease_commence_date', 'resale_price', 'storey_range']]
data.head(5)

,town,flat_type,floor_area_sqm,lease_commence_date,resale_price,storey_range
0,1,2,44.0,1979,232000.0,10
1,1,3,67.0,1978,250000.0,01
2,1,3,67.0,1980,262000.0,01
3,1,3,68.0,1980,265000.0,04
4,1,3,67.0,1980,265000.0,01

In [14]:
#creating train-test sets 
X = data.drop('resale_price',axis =1).values
y = data['resale_price'].values

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=30)

In [15]:
#next, scaling the data 
import numpy as np
from sklearn.preprocessing import StandardScaler

s_scaler = StandardScaler()
X_train = s_scaler.fit_transform(X_train.astype(np.float))
X_test = s_scaler.transform(X_test.astype(np.float))

In [16]:
#now we will test using different models 
from sklearn.ensemble import RandomForestRegressor
rf_reg = RandomForestRegressor(max_depth=25, n_estimators=100)         #through trial and error.. rmse is in the range of 38500-38900. 
rf_reg.fit(X_train, y_train)

y_pred = rf_reg.predict(X_test)

In [17]:
#calculate rmse 
from sklearn import metrics 
print('RMSE:', np.sqrt(metrics.mean_squared_error(y_test, y_pred)))

RMSE: 38082.45129721986

In [18]:
rf_reg.score(X_train, y_train)

0.9660994747712163

In [19]:
#computes r^2 value also 
rf_reg.score(X_test, y_test)

0.9417785547145108

In [20]:
from sklearn.metrics import r2_score
r2_score(y_test, y_pred)

0.9417785547145108

In [22]:
# #save model 
# import pickle

In [23]:
# pickle.dump(rf_reg,open('new_model.pkl','wb'))